cool/tutorials/compressible/rhoPorousSimpleFoam/angledDuctImplicit/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    front
    {
        type            compressible::kqRWallFunction;
        value           uniform 1;
    }

    back
    {
        type            compressible::kqRWallFunction;
        value           uniform 1;
    }

    wall
    {
        type            compressible::kqRWallFunction;
        value           uniform 1;
    }

    porosityWall
    {
        type            compressible::kqRWallFunction;
        value           uniform 1;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
}

// ************************************************************************* //
